Script started on Sat 09 Nov 2019 08:49:40 PM EST
]777;notify;Command completed;exit]0;aagaw29@hdserver:~/hadoop_assignments/HBaseAssignment]7;file://hdserver/home/aagaw29/hadoop_assignments/HBaseAssignment[?1034h[aagaw29@hdserver HBaseAssignment]$ hbase shell
SLF4J: Class path contains multiple SLF4J bindings.
SLF4J: Found binding in [jar:file:/home/aagaw29/hadoop/hbase-1.2.4/lib/slf4j-log4j12-1.7.5.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/home/aagaw29/hadoop/share/hadoop/common/lib/slf4j-log4j12-1.7.10.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: See http://www.slf4j.org/codes.html#multiple_bindings for an explanation.
SLF4J: Actual binding is of type [org.slf4j.impl.Log4jLoggerFactory]
HBase Shell; enter 'help<RETURN>' for list of supported commands.
Type "exit<RETURN>" to leave the HBase Shell
Version 1.2.4, r67592f3d062743907f8c5ae00dbbe1ae4f69e5af, Tue Oct 25 18:10:20 CDT 2016

hbase(main):001:0> create 'User', 'creds', 'prefs', 'a[54G[Jlastlogin'
0 row(s) in 1.4050 seconds

=> Hbase::Table - User
hbase(main):002:0> scan 'User'
ROW                 COLUMN+CELL                                          
0 row(s) in 0.1100 seconds

hbase(main):003:0> put 'u[25G[JUser', 'kss', 'credsL[45G[J:email', 'k@s.com'
0 row(s) in 0.1000 seconds

hbase(main):004:0> put 'User', 'kss', 'creds:m[46G[Jpassword', 'mypasswd'
0 row(s) in 0.0400 seconds

hbase(main):005:0> put 'User', 'kss', pref[42G[J[41G[J[40G[J[39G[J'o[40G[Jprefs:status', 'married'
0 row(s) in 0.0230 seconds

hbase(main):006:0> put 'User', 'l[33G[Jkss', 'prefs:L[46G[Jdate_of_bit[56G[Jrth', '1970/06/03'
0 row(s) in 0.0130 seconds

hbase(main):007:0> put 'User', 'kss', 'prefs:securti[52G[J[51G[Jity_question', 'facority_[2G[J[1G[J[1A[73G[J[J[72G[J[71G[J[70G[J[69G[Jvorite_color'
0 row(s) in 0.0170 seconds

hbase(main):008:0> put 'User', 'kss', 'poref[44G[J[43G[J[42G[J[41G[Jrefs:security_answer', 'red'
0 row(s) in 0.0100 seconds

hbase(main):009:0> put 'User'[29G[J', 'kss', 'lastlogin:ip','128.220.101.100'
0 row(s) in 0.0180 seconds

hbase(main):010:0> out [23G[J[22G[J[21G[J[20G[Jou[21G[J[20G[Jput 'User', 'kss', 'lastlogin:date', '2019:11[64G[J[63G[J[62G[J/11/09'
0 row(s) in 0.0170 seconds

hbase(main):011:0> put 'User',. [32G[J[31G[J 'kss', ;[39G[J'as[41G[J[40G[JlastloginL[49G[J:time', '09:53:49'
0 row(s) in 0.0140 seconds

hbase(main):012:0> scan User
NameError: uninitialized constant User

hbase(main):013:0> scan 'User'
ROW                 COLUMN+CELL                                          
 kss                column=creds:email, timestamp=1573350635689, value=k@
                    s.com                                                
 kss                column=creds:password, timestamp=1573350650742, value
                    =mypasswd                                            
 kss                column=lastlogin:date, timestamp=1573350804879, value
                    =2019/11/09                                          
 kss                column=lastlogin:ip, timestamp=1573350774725, value=1
                    28.220.101.100                                       
 kss                column=lastlogin:time, timestamp=1573350833894, value
                    =09:53:49                                            
 kss                column=prefs:date_of_birth, timestamp=1573350694065, 
                    value=1970/06/03                                     
 kss                column=prefs:security_answer, timestamp=1573350735039
                    , value=red                                          
 kss                column=prefs:security_question, timestamp=15733507189
                    37, value=favorite_color                             
 kss                column=prefs:status, timestamp=1573350667985, value=m
                    arried                                               
1 row(s) in 0.0580 seconds

hbase(main):014:0> put [20G[Jscan 'User'[25G[JUser[20G[Jput 'User', 'kss', 'lastlogin:time', '09:53:49'[50G[Jdate', '2019/11/09'[50G[Jip','128.220.101.100'[40G[Jprefs:security_answer', 'red'[55G[Jquestion', 'favorite_color'[1A[46G[J[Jdate_of_birth', '1970/06/03'[1A[46G[J[Jstatus', 'married'[40G[Jcreds:password', 'mypasswd'[46G[Jemail', 'k@s.com'[20G[Jscan 'User'[20G[Jcreate 'User', 'creds', 'prefs', 'lastlogin'[20G[Jscan 'User'[20G[Jput 'User', 'kss', 'creds:email', 'k@s.com'[62G[61G[60G[59G[58G[57G[56G[55G[54G[53G[52G[51G[50G[49G[48G[47G[46G[45G[44G[43G[42G[41G[40G[39G[38G[37G[36G1', 'creds:email', 'k@s.com'[37G[38G[39G[40G[41G[42G[43G[44G[45G[46G[47G[48G[49G[50G[51G[52G[53G[54G[55G[56G[57G[58G[59G[58G[57G1@s.com'[58G[65G
0 row(s) in 0.0060 seconds

hbase(main):015:0> put 'User', 'kss1', 'creds:password', 'mypasswd'
0 row(s) in 0.0230 seconds

hbase(main):016:0> put 'User', 'kss2[36G[J1', 'lastlogin:ip', '128.220.101.200'
0 row(s) in 0.0170 seconds

hbase(main):017:0> put 'User', 'l[33G[Jkss2', 'lastloginL[50G[J:date', '2019/09/[66G[J[65G[J[64G[J11/09'
0 row(s) in 0.0160 seconds

hbase(main):018:0> put 'User', 'kss2', 'klas[44G[J[43G[J[42G[J[41G[JlastloginL[50G[J:time', '08:55:57'
0 row(s) in 0.0170 seconds

hbase(main):019:0> scan User[28G[J[27G[J[26G[J[25G[J'User'
ROW                 COLUMN+CELL                                          
 kss                column=creds:email, timestamp=1573350635689, value=k@
                    s.com                                                
 kss                column=creds:password, timestamp=1573350650742, value
                    =mypasswd                                            
 kss                column=lastlogin:date, timestamp=1573350804879, value
                    =2019/11/09                                          
 kss                column=lastlogin:ip, timestamp=1573350774725, value=1
                    28.220.101.100                                       
 kss                column=lastlogin:time, timestamp=1573350833894, value
                    =09:53:49                                            
 kss                column=prefs:date_of_birth, timestamp=1573350694065, 
                    value=1970/06/03                                     
 kss                column=prefs:security_answer, timestamp=1573350735039
                    , value=red                                          
 kss                column=prefs:security_question, timestamp=15733507189
                    37, value=favorite_color                             
 kss                column=prefs:status, timestamp=1573350667985, value=m
                    arried                                               
 kss1               column=creds:email, timestamp=1573350861483, value=k1
                    @s.com                                               
 kss1               column=creds:password, timestamp=1573350879853, value
                    =mypasswd                                            
 kss1               column=lastlogin:ip, timestamp=1573350906358, value=1
                    28.220.101.200                                       
 kss2               column=lastlogin:date, timestamp=1573350933443, value
                    =2019/11/09                                          
 kss2               column=lastlogin:time, timestamp=1573350960391, value
                    =08:55:57                                            
3 row(s) in 0.0830 seconds

hbase(main):020:0> deletall [28G[J[27G[J[26G[J[25G[Jeall 'UYse[34G[J[33G[J[32G[Jser', 'kss2'
0 row(s) in 0.0350 seconds

hbase(main):021:0> scan 'User'
ROW                 COLUMN+CELL                                          
 kss                column=creds:email, timestamp=1573350635689, value=k@
                    s.com                                                
 kss                column=creds:password, timestamp=1573350650742, value
                    =mypasswd                                            
 kss                column=lastlogin:date, timestamp=1573350804879, value
                    =2019/11/09                                          
 kss                column=lastlogin:ip, timestamp=1573350774725, value=1
                    28.220.101.100                                       
 kss                column=lastlogin:time, timestamp=1573350833894, value
                    =09:53:49                                            
 kss                column=prefs:date_of_birth, timestamp=1573350694065, 
                    value=1970/06/03                                     
 kss                column=prefs:security_answer, timestamp=1573350735039
                    , value=red                                          
 kss                column=prefs:security_question, timestamp=15733507189
                    37, value=favorite_color                             
 kss                column=prefs:status, timestamp=1573350667985, value=m
                    arried                                               
 kss1               column=creds:email, timestamp=1573350861483, value=k1
                    @s.com                                               
 kss1               column=creds:password, timestamp=1573350879853, value
                    =mypasswd                                            
 kss1               column=lastlogin:ip, timestamp=1573350906358, value=1
                    28.220.101.200                                       
2 row(s) in 0.0270 seconds

hbase(main):022:0> put 'us[26G[J[25G[JUser', 'kss', 'lastlogin:ip[51G[J[50G[Jtime', '08:57:10'
0 row(s) in 0.0150 seconds

hbase(main):023:0> scan 'User'
ROW                 COLUMN+CELL                                          
 kss                column=creds:email, timestamp=1573350635689, value=k@
                    s.com                                                
 kss                column=creds:password, timestamp=1573350650742, value
                    =mypasswd                                            
 kss                column=lastlogin:date, timestamp=1573350804879, value
                    =2019/11/09                                          
 kss                column=lastlogin:ip, timestamp=1573350774725, value=1
                    28.220.101.100                                       
 kss                column=lastlogin:time, timestamp=1573351034161, value
                    =08:57:10                                            
 kss                column=prefs:date_of_birth, timestamp=1573350694065, 
                    value=1970/06/03                                     
 kss                column=prefs:security_answer, timestamp=1573350735039
                    , value=red                                          
 kss                column=prefs:security_question, timestamp=15733507189
                    37, value=favorite_color                             
 kss                column=prefs:status, timestamp=1573350667985, value=m
                    arried                                               
 kss1               column=creds:email, timestamp=1573350861483, value=k1
                    @s.com                                               
 kss1               column=creds:password, timestamp=1573350879853, value
                    =mypasswd                                            
 kss1               column=lastlogin:ip, timestamp=1573350906358, value=1
                    28.220.101.200                                       
2 row(s) in 0.0340 seconds

hbase(main):024:0> deletall 'User', 'kss1'
NoMethodError: undefined method `deletall' for #<Object:0xb0f2d91>

hbase(main):025:0> deletall 'User', 'kss1'[42G[41G[40G[39G[38G[37G[36G[35G[34G[33G[32G[31G[30G[29G[28G[27G[26G[25Geall 'User', 'kss1'[26G[44G
0 row(s) in 0.0070 seconds

hbase(main):026:0> scan User
NameError: uninitialized constant User

hbase(main):027:0> scan User[28G[27G[26G[25G'User[26G[27G[28G[29G[30G'
ROW                 COLUMN+CELL                                          
 kss                column=creds:email, timestamp=1573350635689, value=k@
                    s.com                                                
 kss                column=creds:password, timestamp=1573350650742, value
                    =mypasswd                                            
 kss                column=lastlogin:date, timestamp=1573350804879, value
                    =2019/11/09                                          
 kss                column=lastlogin:ip, timestamp=1573350774725, value=1
                    28.220.101.100                                       
 kss                column=lastlogin:time, timestamp=1573351034161, value
                    =08:57:10                                            
 kss                column=prefs:date_of_birth, timestamp=1573350694065, 
                    value=1970/06/03                                     
 kss                column=prefs:security_answer, timestamp=1573350735039
                    , value=red                                          
 kss                column=prefs:security_question, timestamp=15733507189
                    37, value=favorite_color                             
 kss                column=prefs:status, timestamp=1573350667985, value=m
                    arried                                               
1 row(s) in 0.0610 seconds

hbase(main):028:0> exit
]777;notify;Command completed;hbase shell]0;aagaw29@hdserver:~/hadoop_assignments/HBaseAssignment]7;file://hdserver/home/aagaw29/hadoop_assignments/HBaseAssignment[aagaw29@hdserver HBaseAssignment]$ exit
exit

Script done on Sat 09 Nov 2019 08:58:02 PM EST
